# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4,-2,10,2,0,-9,8,10,-9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

data = [-5, 9, 0, 3, -1, -2, 1, 4,-2,10,2,0,-9,8,10,-9, 0, -5, -5, 7]
left_bound = int(input("Введите начальный элемент диапозона: \n"))
right_bound = int(input("Введите конечный элемент диапозона: \n"))

def func_x(left, right, list_1: list):
    list_2 = []
    for x in range(len(list_1)): 
        if list_1[x] >= left and list_1[x] <= right: list_2.append(x)                
    return list_2
print(func_x(left_bound, right_bound, data))